#+BEGIN_COMMENT
.. title: Local Variables & MobileOrg
.. slug: 
.. date: 2020-01-14 23:06:12 UTC+02:00
.. tags: org-mode, emacs
.. category: 
.. link: 
.. description: Local Variables
.. type: text
.. status: 
#+END_COMMENT

#+BEGIN_EXPORT html
<br>
<br>
#+END_EXPORT

During the last couple of weeks I completed an emacs integration I
desired to complete since long time. I managed to fully synchronize my
emacs calendar with an online one.

This allows me to have an integrated look and finally work on a
consistent agenda across devices to organize myself better. It
moreover allows me to have a quick glimpse on my agenda in emacs.

In order to do that I relied on [[https://cestlaz.github.io/posts/using-emacs-26-gcal/][this]] nice video of /C'est la Z/. The
basic idea is to integrate the Emacs Calendar and synchronize it with
your Google Calendar such that each time you open your agenda on Emacs
your org-agenda will be imported in the Google Calendar and conversely
the Google Calendar entries will be integrated into your org
agenda. You can find the details of the step up in the above link and
this will not be discussed in the post.

Nonetheless, I further enriched the approach with an integration via
=mobileorg=. This allows me to write new entries in my agenda directly
from my mobile and allows me a more emacs-focused approach and better
deletion and archiving possibilities in comparison to working on the
Google Calendar on my phone. The structure is the following.

{{{TEASER_END}}}

* Mobile Org

    The idea of the second, above mentioned integration, is to create
    an org files to be added to your agenda files list that will
    automatically synchronize with Dropbox and accordingly with the
    =MobileOrg= application. This is a very well done application
    where you can edit all of your calendar entries.

    #+BEGIN_SRC emacs-lisp
    ;; Create and Specify Agenda folder.
    (setq org-agenda-files (list "~/Dropbox/Applicazioni/MobileOrg/capture.org"
				 "~/Dropbox/Applicazioni/MobileOrg/mobileorg.org"
				 "~/Dropbox/Applicazioni/MobileOrg/inbox.org"
				 "~/Dropbox/Applicazioni/MobileOrg/todos.org"))
    #+END_SRC

    #+RESULTS:
    | ~/Desktop/org/capture.org | ~/Dropbox/Applicazioni/MobileOrg/mobileorg.org | ~/Desktop/TODOs/ |
    
    #+BEGIN_SRC emacs-lisp
    (setq org-mobile-directory "~/Dropbox/Applicazioni/MobileOrg/") 
    #+END_SRC

    Like this it will possible for you to update your agenda directly
    from the well done =beorg app=. Moreover it will be possible to
    automatically update your agenda from any of your devices given
    the compatibility with dropbox. 

    Finally you can integrate any of the google calendar events
    automatically to your org agenda and your mobile app
    automatically. In case you will want to increase security you can
    even encrypt all of the storage on dropbox and have a bullet proof
    security in terms of who can read your agenda in case dropbox
    security fails.

    A final but unrelated mention is given to =local variables= in
    emacs. This is a nice feature I discovered duckduckgoing around
    searching for possibilities to properly use my org-agenda. 
    These are specific settings that apply to the specific document
    and perform a piece of emacs code automatically just for the file
    where they are specified in. This is a quite handy emacs
    trick. You can see an example below if you want to automatically
    create an =.ics= for this specific files (assuming you would have
    some scheduled event), which you could actually use to integrate
    it with your apps.

* Local var

   #+BEGIN_EXAMPLE
 # Local Variables:
 # eval: (add-hook 'after-save-hook 'org-icalendar-export-to-ics nil t)
 # End:

 with just one comment mark it functions.
   #+END_EXAMPLE
